In [3]:
users = pd.read_excel("Data.xlsx",sheet_name='Day 8')
users

   user_id       name                     mail
0        1    Winston     winston@leetcode.com
1        2   Jonathan          jonathanisgreat
2        3  Annabelle      bella-@leetcode.com
3        4      Sally  sally.come@leetcode.com
4        5     Marwan  quarz#2020@leetcode.com
5        6      David        david69@gmail.com
6        7    Shapiro      .shapo@leetcode.com

In [4]:
valid_users = users[users['mail'].str.match(r'^[a-zA-Z][a-zA-Z0-9_.-]*@leetcode\.com$')]

In [5]:
valid_users

   user_id       name                     mail
0        1    Winston     winston@leetcode.com
2        3  Annabelle      bella-@leetcode.com
3        4      Sally  sally.come@leetcode.com

In [2]:
import pandas as pd

In [6]:
patients = pd.read_excel("Data.xlsx",sheet_name='Day 9')
patients

   patient_id patient_name    conditions
0           1       Daniel    YFEV COUGH
1           2        Alice           NaN
2           3          Bob  DIAB100 MYOP
3           4       George  ACNE DIAB100
4           5        Alain       DIAB201

In [7]:
patients.dropna(inplace=True)

In [8]:
patients

   patient_id patient_name    conditions
0           1       Daniel    YFEV COUGH
2           3          Bob  DIAB100 MYOP
3           4       George  ACNE DIAB100
4           5        Alain       DIAB201

In [ ]:

patients_with_diabetes = patients[patients['conditions'].str.contains(r'\bDIAB1')]


patients_with_diabetes